//*****************************************************************************************//
//**                                                                                     **//
//**                   　　　　　マウス座標処理.h                                        **//
//**                                                                                     **//
//*****************************************************************************************//

int rectangle_button(int xm, int ym, int bt2on, int bt2of, int x, int y, char *str, int f, int fr);

int mouse(alldata *p,int f, int *offset);
